In [1]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/stock')
const = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3')
conlite = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3')
conlt = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3')
conmy = engine.connect()
engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()
engine = create_engine('postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development')
conpg = engine.connect()

### Name change

In [2]:
old_name = 'MAKRO'
new_name = 'CPAXT'

In [3]:
sql = '''
SELECT *
FROM stockname
WHERE name = "%s"'''
sql = sql % (old_name)
stock = pd.read_sql(sql, const)
stock

    name category sector  inport  onwatch  hd  top100
0  MAKRO            COMM       0        0   0       0

In [4]:
sql = '''
UPDATE stockname
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE stockname
SET name = "CPAXT"
WHERE name = "MAKRO"

In [5]:
rp = const.execute(sql)
rp.rowcount

1

In [6]:
sql = '''
SELECT *
FROM price
WHERE name = "%s"'''
sql = sql % (old_name)
price = pd.read_sql(sql, const)
price.shape

(1638, 7)

In [7]:
sql = '''
UPDATE price
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE price
SET name = "CPAXT"
WHERE name = "MAKRO"

In [8]:
rp = const.execute(sql)
rp.rowcount

1638

In [9]:
sql = '''
UPDATE stocks
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE stocks
SET name = "CPAXT"
WHERE name = "MAKRO"

In [10]:
rp = conlite.execute(sql)
rp.rowcount

0

In [11]:
sql = '''
UPDATE buy
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE buy
SET name = "CPAXT"
WHERE name = "MAKRO"

In [12]:
rp = const.execute(sql)
rp.rowcount

0

### Tickers table

In [13]:
sql = '''
SELECT *
FROM tickers
WHERE name = "%s"'''
sql = sql % (old_name)
ticker = pd.read_sql(sql, conlt)
ticker

,id,name,full_name,sector,subsector,market,website,created_at,updated_at
0,283,MAKRO,SIAM MAKRO PUBLIC COMPANY LIMITED,Services,Commerce,SET,www.siammakro.co.th,2017-07-23 06:31:23.967729,2017-07-23 06:31:23.967729

In [14]:
sql = '''
UPDATE tickers
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE tickers
SET name = 'CPAXT'
WHERE name = 'MAKRO'

In [15]:
rp = conlt.execute(sql)
rp.rowcount

1

In [16]:
rp = conmy.execute(sql)
rp.rowcount

1

In [17]:
rp = conpg.execute(sql)
rp.rowcount

1

### Stocks table

In [18]:
sql = '''
UPDATE stocks
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE stocks
SET name = 'CPAXT'
WHERE name = 'MAKRO'

In [19]:
rp = conlt.execute(sql)
rp.rowcount

1

In [20]:
rp = conmy.execute(sql)
rp.rowcount

1

In [21]:
rp = conpg.execute(sql)
rp.rowcount

1

### EPSS table

In [22]:
sql = '''
UPDATE epss
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE epss
SET name = 'CPAXT'
WHERE name = 'MAKRO'

In [23]:
rp = conlt.execute(sql)
rp.rowcount

31

In [24]:
rp = conpg.execute(sql)
rp.rowcount

31

### QT_PROFITS table

In [25]:
sql = '''
UPDATE qt_profits
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE qt_profits
SET name = 'CPAXT'
WHERE name = 'MAKRO'

In [26]:
rp = conlt.execute(sql)
rp.rowcount

27

### YR_PROFITS table

In [27]:
sql = '''
UPDATE yr_profits
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE yr_profits
SET name = 'CPAXT'
WHERE name = 'MAKRO'

In [28]:
rp = conlt.execute(sql)
rp.rowcount

24

In [29]:
rp = conpg.execute(sql)
rp.rowcount

24

### PROFITS table

In [30]:
sql = '''
UPDATE profits
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE profits
SET name = 'CPAXT'
WHERE name = 'MAKRO'

In [31]:
rp = conlt.execute(sql)
rp.rowcount

0

In [32]:
rp = conmy.execute(sql)
rp.rowcount

0

In [33]:
rp = conpg.execute(sql)
rp.rowcount

0

### CONSENSUS table

In [34]:
sql = '''
UPDATE consensus
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE consensus
SET name = 'CPAXT'
WHERE name = 'MAKRO'

In [35]:
rp = conlt.execute(sql)
rp.rowcount

1

In [36]:
rp = conmy.execute(sql)
rp.rowcount

1

In [37]:
rp = conpg.execute(sql)
rp.rowcount

1

### Portfolio database

In [38]:
sql = '''
SELECT * 
FROM stocks
WHERE name = '%s'
'''
sql = sql % old_name
df_tmp = pd.read_sql(sql, conpf)
df_tmp

    id   name  category_id website
0  202  MAKRO            3

In [39]:
sql = '''
UPDATE stocks
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE stocks
SET name = "CPAXT"
WHERE name = "MAKRO"

In [40]:
rp = conpf.execute(sql)
rp.rowcount

1

In [41]:
sql = '''
SELECT * 
FROM dividends
WHERE name = '%s'
'''
sql = sql % old_name
df_tmp = pd.read_sql(sql, conpf)
df_tmp

,id,stock_id,name,year,quarter,number,ppu,amt,net,x_date,p_date
0,322,202,MAKRO,2021,4,3000,0.32,960.0,864.0,2022-03-03,2022-05-19
1,346,202,MAKRO,2022,2,7500,0.18,1350.0,1215.0,2022-08-22,2022-09-06

In [42]:
sql = '''
UPDATE dividends
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE dividends
SET name = "CPAXT"
WHERE name = "MAKRO"

In [43]:
rp = conpf.execute(sql)
rp.rowcount

2

### Manually chage name-ttl.csv & price-uploads.csv